import matplotlib.pyplot as plt

steps = [0, 20, 40, 60, 80, 100, 120, 140, 160, 180, 200, 220, 240, 260, 280, 300]
time_1 = [10.041758, 29.956566, 48.089001, 69.795489, 92.126215, 114.775768, 137.477678, 159.92577,
          180.805026, 202.757972, 224.3193, 244.993319, 265.606183, 294.657049, 316.92164, 336.893371]
time_2 = [79.768559, 234.744844, 371.65426, 493.604928, 628.438215, 752.634891, 887.051431, 1013.749088,
          1149.747293, 1268.418796, 1394.279048, 1522.995203, 1662.783407, 1783.801128, 1916.011821, 2057.903325]

plt.figure(figsize=(10, 6))
plt.plot(steps, time_2, label='Простой цикл', marker='o')
plt.plot(steps, time_1, label='Параллельный цикл', marker='d')

plt.xlabel('Количество трассировочных точек')
plt.ylabel('Время (мс)')
plt.legend()
plt.grid(True, linestyle='--', alpha=0.6)

plt.show()
